{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Billing and Payments",
    "1": "Customer Service",
    "2": "General Inquiry",
    "3": "Sales and Pre-Sales",
    "4": "Technical Support"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Billing and Payments": 0,
    "Customer Service": 1,
    "General Inquiry": 2,
    "Sales and Pre-Sales": 3,
    "Technical Support": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.1.0",
  "vocab_size": 30522
}
